app/controllers/summaries_controller.rb

  def create
    @summary = current_user.summaries.new(summary_params)
    @summary.status = true
    if @summary.save
---
INSERT INTO `summaries` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('', 1, '2021-08-05 16:42:17.343033', '2021-08-05 16:42:17.343033')

  def destroy
    if Summary.find_by(id: params[:id]).update(status: false)
---
SELECT `summaries`.* FROM `summaries` WHERE `summaries`.`id` = 2 ORDER BY `summaries`.`created_at` DESC LIMIT 1