app/controllers/users_controller.rb

  def found_user
    @user = User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def show
    @summary_list = @user.summaries.where("status = 1")
---
SELECT `summaries`.* FROM `summaries` WHERE `summaries`.`user_id` = 1 ORDER BY `summaries`.`created_at` DESC

  def update
    @user.user_profile.image.attach(params[:user][:image])
    if @user.update(user_params) && @user.user_profile.update(user_profile_params)
---
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('metghe', 'firesoul0608@gmail.com', '2021-08-01 09:30:06.918489', '2021-08-01 09:30:06.918489', '$2a$12$yDYp1lM5lxkYr7WsHwlZpukCazpuUp5qUyEsxHxkrw19cUuy4IGZe')
UPDATE `user_profiles` SET `user_profiles`.`fullname` = 'LE DUY VUONG', `user_profiles`.`sex` = 'Nu', `user_profiles`.`address` = 'Tran Phu', `user_profiles`.`phone` = '0357380529', `user_profiles`.`updated_at` = '2021-08-05 06:50:49.894955' WHERE `user_profiles`.`id` = 1

  def create
    @user = User.new(user_params)
    if @user.save &&  @user.create_user_profile(fullname: @user.username)
---
INSERT INTO `user_profiles` (`fullname`, `user_id`, `created_at`, `updated_at`) VALUES ('metghe', 1, '2021-08-05 16:07:54.033985', '2021-08-05 16:07:54.033985')
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('metghe', 'firesoul0608@gmail.com', '2021-08-05 16:07:54.007284', '2021-08-05 16:07:54.007284', '$2a$12$hN.IJ3aVqia3gK7uiytYDOjjQsznVURbi6xLT39dlSkeLG6XR3GMa')